tap "adoptopenjdk/openjdk"
tap "bramstein/webfonttools"
tap "derailed/k9s"
tap "dteoh/sqa"
tap "fabianishere/personal"
tap "getantibody/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "teamookla/speedtest"
brew "ack"
brew "aircrack-ng"
brew "xz"
brew "ansible"
brew "asciinema"
brew "autossh"
brew "azure-cli"
brew "bat"
brew "bfg"
brew "binutils"
brew "binwalk"
brew "chezmoi"
brew "cifer"
brew "coreutils"
brew "ctags"
brew "curl"
brew "dex2jar"
brew "diff-so-fancy"
brew "dns2tcp"
brew "entr"
brew "exa"
brew "fasd"
brew "fcrackzip"
brew "fd"
brew "gmp"
brew "gnutls"
brew "icu4c"
brew "ffmpeg"
brew "foremost"
brew "fzf"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "pinentry"
brew "gnupg"
brew "go"
brew "goaccess"
brew "grep"
brew "hashpump"
brew "lua"
brew "hopenpgp-tools"
brew "hstr"
brew "htop"
brew "hydra"
brew "imagemagick"
brew "iperf3"
brew "irssi"
brew "john"
brew "jq"
brew "knock"
brew "knot"
brew "kubectx"
brew "libsodium"
brew "locateme"
brew "lynx"
brew "mackup"
brew "ruby"
brew "macvim"
brew "magic-wormhole"
brew "mas"
brew "mosh"
brew "mtr"
brew "ncdu"
brew "netpbm"
brew "ninja"
brew "nmap"
brew "node"
brew "noti"
brew "opensc"
brew "openssh"
brew "php"
brew "pigz"
brew "pinentry-mac"
brew "pngcheck"
brew "pv"
brew "reattach-to-user-namespace"
brew "rename"
brew "rlwrap"
brew "screen"
brew "shadowsocks-libev"
brew "simple-obfs"
brew "socat"
brew "sqlmap"
brew "ssh-copy-id", link: true
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
brew "telnet"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tree"
brew "ucspi-tcp"
brew "vbindiff"
brew "wakeonlan"
brew "wget"
brew "wifi-password"
brew "wimlib"
brew "woff2"
brew "xpdf"
brew "yarn"
brew "ykpers"
brew "ykman"
brew "yubico-piv-tool"
brew "zopfli"
brew "zsh"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "derailed/k9s/k9s"
brew "fabianishere/personal/pam_reattach"
brew "getantibody/tap/antibody"
brew "heroku/brew/heroku"
brew "teamookla/speedtest/speedtest"
cask "1password-cli"
cask "adoptopenjdk"
cask "alfred"
cask "aws-vault"
cask "daisydisk"
cask "discord"
cask "docker"
cask "dockey"
cask "dropbox"
cask "fantastical"
cask "firefox"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "launchbar"
cask "little-snitch"
cask "macmediakeyforwarder"
cask "micro-snitch"
cask "minecraft"
cask "mounty"
cask "nrlquaker-winbox"
cask "parsec"
cask "powershell"
cask "qlcolorcode"
cask "qlcommonmark"
cask "qlstephen"
cask "qq"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookapk"
cask "skype"
cask "slowquitapps"
cask "spotify"
cask "sublime-text"
cask "suspicious-package"
cask "teamspeak-client"
cask "teamviewer"
cask "telegram"
cask "transmit"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "wechat"
cask "wireshark"
mas "AutoSwitchInput", id: 1470350547
mas "DevCleaner", id: 1388020431
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Pages", id: 409201541
mas "Tweetbot", id: 1384080005
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
mas "Yoink", id: 457622435
