tap "adoptopenjdk/openjdk"
tap "ameshkov/tap"
tap "birkhofflee/birkhoff"
tap "bramstein/webfonttools"
tap "buo/cask-upgrade"
tap "cjbassi/ytop"
tap "cloudflare/cloudflare"
tap "derailed/k9s"
tap "dteoh/sqa"
tap "fabianishere/personal"
tap "getantibody/tap"
tap "gofireflyio/aiac"
tap "golangci/tap"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "joedrago/repo"
tap "louisbrunner/valgrind"
tap "teamookla/speedtest"
tap "zurawiki/brews"
# Search tool like grep, but optimized for programmers
brew "ack"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# GNU database manager
brew "gdbm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Record and share terminal sessions
brew "asciinema"
# Core application library for C
brew "glib"
# Portable Foreign Function Interface library
brew "libffi"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# GNOME accessibility toolkit
brew "atk"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# B2 Cloud Storage Command-Line Tools
brew "b2-tools"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# GNU binary tools for native development
brew "binutils"
# GNU multiple precision arithmetic library
brew "gmp"
# Palette quantization library extracted from pnquant2
brew "libimagequant"
# Library for complex text layout
brew "libraqm"
# Package for scientific computing with Python
brew "numpy"
# Tool Command Language
brew "tcl-tk"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Parser generator
brew "bison"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Work on automating classical cipher cracking in C
brew "cifer"
# Convert a Container Linux Config into Ignition
brew "coreos-ct"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Shell script to build fancy DMGs
brew "create-dmg"
# Reimplementation of ctags(1)
brew "ctags"
# Tools to work with Android .dex and Java .class files
brew "dex2jar"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Diff that understands syntax
brew "difftastic"
# TCP over DNS tunnel
brew "dns2tcp"
# It is system for maintaining DNS zones
brew "dnscontrol"
# Tool for managing dock items
brew "dockutil"
# Run arbitrary commands when files change
brew "entr"
# Modern replacement for 'ls'
brew "exa"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# NaCl networking and cryptography library
brew "libsodium"
# Framework for layout and rendering of i18n text
brew "pango"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# CLI application for interacting with a Cloudflare account
brew "flarectl"
# Console program to recover files based on their headers and footers
brew "foremost"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Frame Streams implementation in C
brew "fstrm"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Image manipulation
brew "netpbm"
# Optical Character Recognition (OCR), converts images back to text
brew "gocr"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# GNU grep, egrep and fgrep
brew "grep"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# GUI toolkit
brew "gtk+"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Tool to exploit hash length extension attack
brew "hashpump"
# Kubernetes package manager
brew "helm"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Command-line tools for OpenPGP-related operations
brew "hopenpgp-tools"
# Bash and zsh history suggest box
brew "hstr"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Open source relational database management system
brew "mysql-client"
# Network logon cracker which supports many services
brew "hydra"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Port-knock server
brew "knock"
# Protocol buffers library
brew "protobuf-c"
# High-performance authoritative-only DNS server
brew "knot"
# Network authentication protocol
brew "krb5"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# DNS library written in C
brew "ldns"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Library and utility to talk to iBoot/iBSS via USB
brew "libirecovery"
# Postgres C API library
brew "libpq"
# Library that provides automatic proxy configuration management
brew "libproxy"
# YAML Parser
brew "libyaml"
# Find your location using Apple's geolocation services
brew "locateme"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Powerful, lightweight programming language
brew "lua"
# Fast and simple video downloader
brew "lux"
# Text-based web browser
brew "lynx"
# Swiss Army Knife for macOS
brew "m-cli"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# GUI for vim, made for macOS
brew "macvim"
# Securely transfers data between computers
brew "magic-wormhole"
# Mac App Store command-line interface
brew "mas"
# Fast Cross-Platform Package Manager
brew "micromamba"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Remote terminal application
brew "mosh"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Trigger notifications when a process completes
brew "noti"
# Libraries for security-enabled client and server applications
brew "nss"
# Oracle Cloud Infrastructure CLI
brew "oci-cli"
# Optical character recognition (OCR) program
brew "ocrad"
# Tools and libraries for smart cards
brew "opensc"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# PNG file optimizer
brew "optipng"
# Outputs current CPU temperature for OSX
brew "osx-cpu-temp"
# Painless compression and decompression for your terminal
brew "ouch"
# New zlib (gzip, deflate) compatible compressor
brew "zopfli"
# Parallel gzip
brew "pigz"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Print info and check PNG, JNG, and MNG files
brew "pngcheck"
# Modern replacement for ps written by Rust
brew "procs"
# Implementation of Telnet and SSH
brew "putty"
# Monitor data's progress through a pipe
brew "pv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Cross-platform application and UI framework
brew "qt"
# Cross-platform application and UI framework
brew "qt@5"
# Software environment for statistical computing
brew "r"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Fast, efficient and secure backup program
brew "restic"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Monitors sleep, wakeup, and idleness of a Mac
brew "sleepwatcher", restart_service: true
# Terminal based presentation tool
brew "slides"
# SOcket CAT: netcat on steroids
brew "socat"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Test SSL/TLS enabled services to discover supported cipher suites
brew "sslscan"
# Tool to impose load on and stress test a computer system
brew "stress"
# Version control system designed to be a better CVS
brew "subversion"
# TCP/IP packet demultiplexer
brew "tcpflow"
# TCP connect to the given IP/port combo
brew "tcping"
# Replay saved tcpdump files at arbitrary speeds
brew "tcpreplay"
# Analyze tcpdump output
brew "tcptrace"
# Traceroute implementation using TCP packets
brew "tcptraceroute"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Tool to build, change, and version infrastructure
brew "terraform"
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer"
# Tool which checks for the support of TLS/SSL ciphers and flaws
brew "testssl"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Tools for building TCP client-server applications
brew "ucspi-tcp"
# Visual Binary Diff
brew "vbindiff"
# Disaster recovery for Kubernetes resources and persistent volumes
brew "velero"
# Modern watch command
brew "viddy"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Internet file retriever
brew "wget"
# Network settings helper
brew "whatmask"
# Show the current WiFi network password
brew "wifi-password"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# PDF viewer
brew "xpdf"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Tool for managing your YubiKey configuration
brew "ykman"
# YubiKey personalization library and tool
brew "ykpers"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Command-line tool for the YubiKey PIV application
brew "yubico-piv-tool"
# UNIX shell (command interpreter)
brew "zsh"
# Simple command-line utility to make DNS lookups using any protocol
brew "ameshkov/tap/dnslookup"
# Get a file from an HTTP, HTTPS or FTP server
brew "birkhofflee/birkhoff/curl"
# Convert existing TrueType/OpenType fonts to WOFF format
brew "bramstein/webfonttools/sfnt2woff"
# WOFF utilities with Zopfli compression
brew "bramstein/webfonttools/sfnt2woff-zopfli"
# A TUI system monitor written in Rust
brew "cjbassi/ytop/ytop"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# PAM module for reattaching to the user's GUI (Aqua) session
brew "fabianishere/personal/pam_reattach"
# Artificial Intelligence Infrastructure-as-Code Generator
brew "gofireflyio/aiac/aiac"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
# Nomad
brew "hashicorp/tap/nomad"
# Packer
brew "hashicorp/tap/packer"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Git prepare-commit-msg hook for authoring commit messages with GPT-3
brew "zurawiki/brews/gptcommit"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# Utility to set a Retina display to custom resolutions
cask "avibrazil-rdm"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault"
# Data backup and storage service
cask "backblaze"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Cryptocurrency exchange
cask "binance"
# Menu bar application that lists iCloud Tabs
cask "cloudytabs"
# Disk space visualizer
cask "daisydisk"
# Voice and text chat software
cask "discord"
cask "dockey"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
cask "font-menlo-for-powerline"
cask "font-source-code-pro"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake"
# Free and open-source media player
cask "iina"
# iPhone management application
cask "imazing"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Display key code, unicode value and modifier keys state for any key combination
cask "key-codes"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Link-Layer MAC spoofing GUI for macOS
cask "linkliar"
# Host-based application firewall
cask "little-snitch"
# Media key forwarder for iTunes and Spotify
cask "macmediakeyforwarder"
# Re-mounts write-protected NTFS volumes
cask "mounty"
# Free and open-source RSS reader
cask "netnewswire"
# MikroTik Winbox
cask "nrlquaker-winbox"
# Replacement for Docker Desktop
cask "orbstack"
# Remote desktop
cask "parsec"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Instant messaging tool
cask "qq"
# QuickLook plugin for CSV files
cask "quicklook-csv"
# QuickLook plugin for JSON files
cask "quicklook-json"
# Quick Look plugin for Android packages
cask "quicklookapk"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Collection of apps available by subscription
cask "setapp"
# Video chat, voice call and instant messaging application
cask "skype"
# Displays all open files and sockets in use by all running processes
cask "sloth"
cask "slowquitapps"
# Text editor for code, markup and prose
cask "sublime-text"
# Application for inspecting installer packages
cask "suspicious-package"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# File transfer application
cask "transmit"
# Configurable document editor that supports Markdown
cask "typora"
# Development environment
cask "vagrant"
# Open-source code editor
cask "visual-studio-code"
# Free messaging and calling application
cask "wechat"
# Network protocol analyzer
cask "wireshark"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Craft", id: 1487937127
mas "DevCleaner", id: 1388020431
mas "GarageBand", id: 682658836
mas "GoodNotes", id: 1444383602
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Tab Space", id: 1473726602
mas "Tailscale", id: 1475387142
mas "The Unarchiver", id: 425424353
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
mas "Yoink", id: 457622435
